Revit 2027 API
View.GetBackground Method
 Returns the current background set for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplayBackground GetBackground()
Public Function GetBackground As ViewDisplayBackground
public:
ViewDisplayBackground^ GetBackground()
member GetBackground : unit -> ViewDisplayBackground
Return Value
ViewDisplayBackground
 Current background.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace